Revit 2024 API
Transform1D Constructor (Transform1D)
 The copy constructor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public Transform1D(
	Transform1D other
)
Visual Basic
Public Sub New ( _
	other As Transform1D _
)
Visual C++
public:
Transform1D(
	Transform1D^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Transform1D
 The transformation to use as input.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Transform1D Class
Transform1D Overload
Autodesk.Revit.DB Namespace